## <font color="black"><h4 align="center">7-6 Handling Missing Data - replace method</font>

In [2]:
import pandas as pd
import numpy as np
df = pd.read_csv("7-6_weather_data.csv")
df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017           32          6   Rain         NaN
1  1/2/2017       -99999          7  Sunny         NaN

**Replacing single value**

In [3]:
new_df = df.replace(-99999, value=np.NaN)
new_df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017         32.0        6.0   Rain         NaN
1  1/2/2017          NaN        7.0  Sunny         NaN

**Replacing list with single value**

In [4]:
new_df = df.replace(to_replace=[-99999,-88888], value=0)
new_df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017           32          6   Rain         NaN
1  1/2/2017            0          7  Sunny         NaN

**Replacing per column**

In [5]:
new_df = df.replace({
        'temperature': -99999,
        'windspeed': -99999,
        'event': '0'
    }, np.nan)
new_df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017         32.0        6.0   Rain         NaN
1  1/2/2017          NaN        7.0  Sunny         NaN

**Replacing by using mapping**

In [6]:
new_df = df.replace({
        -99999: np.nan,
        'no event': 'Sunny',
    })
new_df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017         32.0        6.0   Rain         NaN
1  1/2/2017          NaN        7.0  Sunny         NaN

**Regex**

In [7]:
# when windspeed is 6 mph, 7 mph etc. & temperature is 32 F, 28 F etc.
new_df = df.replace({'temperature': '[A-Za-z]', 'windspeed': '[a-z]'},'', regex=True) 
new_df.head(2)

        day  temperature  windspeed  event  Unnamed: 4
0  1/1/2017           32          6   Rain         NaN
1  1/2/2017       -99999          7  Sunny         NaN

**Replacing list with another list**

In [8]:
df = pd.DataFrame({
    'score': ['exceptional','average', 'good', 'poor', 'average', 'exceptional'],
    'student': ['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df.head(2)

         score student
0  exceptional     rob
1      average    maya

In [43]:
df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica